app/controllers/designers_controller.rb

    def index
      if params[:product_id]
        @designers = Products.find(params[:product_id]).designers
      else
        @designers = Designer.all
---
SELECT "designers".* FROM "designers"