app/controllers/products_controller.rb

    def index
      if params[:type_id]
        @products = Type.find(params[:type_id]).products
      elsif params[:designser_id]
        @product = Designer.find(params[:designer_id]).products
      else
        @products = Product.all
---
SELECT  "types".* FROM "types" WHERE "types"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."type_id" = $1  [["type_id", 66]]
SELECT  "types".* FROM "types" WHERE "types"."id" = $1 LIMIT $2  [["id", 66], ["LIMIT", 1]]
SELECT "products".* FROM "products"