app/controllers/types_controller.rb

    def index
      if params[:category_id]
        @types = Category.find(params[:category_id]).types
      else
        @types = Type.all
---
SELECT "types".* FROM "types" WHERE "types"."category_id" = $1  [["category_id", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      def set_type
        @type = Type.find(params[:id])
---
SELECT  "types".* FROM "types" WHERE "types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]