app/controllers/users_controller.rb

      def create
        @user = User.create!(user_params)
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "auth_token", "password_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"